_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 128, 16)           864       
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 128, 1024)         82944     
_________________________________________________________________
batch_normalization_1 (Batch (None, 128, 1024)         4096      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 64, 1024)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 1024)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 64, 1024)          5243904   
_________________________________________________________________
batch_normalization_2 (Batch (None, 64, 1024)          4096      
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 32, 1024)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 1024)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 32, 1024)          5243904   
_________________________________________________________________
batch_normalization_3 (Batch (None, 32, 1024)          4096      
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 16, 1024)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 16, 1024)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 16, 1024)          5243904   
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 1024)          4096      
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 8, 1024)           0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 1024)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 8, 1024)           5243904   
_________________________________________________________________
batch_normalization_5 (Batch (None, 8, 1024)           4096      
_________________________________________________________________
global_max_pooling1d_1 (Glob (None, 1024)              0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
batch_normalization_6 (Batch (None, 1024)              4096      
_________________________________________________________________
dropout_6 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 53)                54325     
=================================================================
Total params: 22,187,925
Trainable params: 22,175,637
Non-trainable params: 12,288
_________________________________________________________________
